Tekla Open API Reference for Tekla Structures 2025
Mesh.Lines Property
 An array list of indices (as integers) pointing to the points array list. Two consecutive indices always represent a single line.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Lines { get; }
Public ReadOnly Property Lines As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace